Revit 2024 API
IndexPoint Properties
The IndexPoint type exposes the following members.
Properties
Name | Description
Index
 The index of the point's vertex.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from IndexPrimitive.)
See Also
IndexPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace